Bharaths25/STM32H753xx_BareMetalCode/test_board1/Inc/stm32h753_gpio_driver.h
/*
 * stm32h753_gpio_driver.h
 *
 *  Created on: Jun 25, 2024
 *      Author: Bharath
 */

#ifndef STM32H753_GPIO_DRIVER_H_
#define STM32H753_GPIO_DRIVER_H_


#include "stm32h753xx.h"

//pin configuration stucture
typedef struct
{
	uint8_t GPIO_PinNumber;
	uint8_t GPIO_PinMode;   //possible values from  @GPIO_pin_modes
	uint8_t GPIO_PinSpeed;  // possible values of @GPIO_OUTPUT_SPEEDS
	uint8_t GPIO_PinPuPdControl;  // possible values of @GPIO_PUPD_CONFIG
	uint8_t GPIO_PinOtype;   // possible values of @GPIO_OUTPUT_TYPES
	uint8_t GPIO_PinAltFunction;  // possible values of alternate function

}GPIO_PinConfig_t;


// handle structure for GPIO pin

typedef struct
{
	// pointer to hold the base address of the GPIO peripheral
    GPIO_RegDef_t *pGPIOx;   // Holds the base address of the gpio port to which the pin belongs
	GPIO_PinConfig_t   GPIO_PinConfig;  // This holds GPIO pin configuration settings

}GPIO_Handle_t;


// @GPIO_PIN_NO
//GPIO POSSIBLE PIN NUMBER

#define GPIO_PIN_NO_0            0
#define GPIO_PIN_NO_1            1
#define GPIO_PIN_NO_2            2
#define GPIO_PIN_NO_3            3
#define GPIO_PIN_NO_4            4
#define GPIO_PIN_NO_5            5
#define GPIO_PIN_NO_6            6
#define GPIO_PIN_NO_7            7
#define GPIO_PIN_NO_8            8
#define GPIO_PIN_NO_9            9
#define GPIO_PIN_NO_10          10
#define GPIO_PIN_NO_11          11
#define GPIO_PIN_NO_12          12
#define GPIO_PIN_NO_13          13
#define GPIO_PIN_NO_14          14
#define GPIO_PIN_NO_15          15


// @GPIO_pin_modes
//GPIO pin possible modes

#define GPIO_MODE_IN 		0
#define GPIO_MODE_OUT 		1
#define GPIO_MODE_AF 		2
#define GPIO_MODE_ANALOG 	3
#define GPIO_MODE_IT_FT 	4
#define GPIO_MODE_IT_RT 	5
#define GPIO_MODE_IT_RFT 	6

//@GPIO_OUTPUT_TYPES
//GPIO output possible types

#define GPIO_OP_TYPE_PP 	0
#define GPIO_OP_TYPE_OD 	1

// @GPIO_OUTPUT_SPEEDS
//GPIO pin possible output speeds

#define GPIO_SPEED_LOW 			0
#define GPIO_SPEED_MEDIUM 		1
#define GPIO_SPEED_FAST 		2
#define GPIO_SPEED_HIGH 		3

// @GPIO_PUPD_CONFIG
//GPIO pin pupd configuration

#define GPIO_PIN_NO_PUPD 	0
#define GPIO_PIN_PU 		1
#define GPIO_PIN_PD 		2




/*********************************************************************************************************
 *                           APIs supported by this driver
 *                 for more information about the APIs check the function definitions
 *********************************************************************************************************/


//periperal clock configuartion

void GPIO_PeriClockContrl(GPIO_RegDef_t *pGPIOx, uint8_t EnorDi);


// init and de-init

void GPIO_Init(GPIO_Handle_t *pGPIOHandle);
void GPIO_DeInit(GPIO_RegDef_t *pGPIOx);

// Data Read and Write

uint8_t GPIO_ReadFromInputPin(GPIO_RegDef_t *pGPIOx, uint8_t PinNumber);
uint16_t GPIO_ReadFromInputPort(GPIO_RegDef_t *pGPIOx);
void GPIO_WriteToOutputPIn(GPIO_RegDef_t *pGPIOx, uint8_t PinNumber,uint8_t Value);
void GPIO_WriteToOutputPort(GPIO_RegDef_t *pGPIOx, uint16_t Value);
void GPIO_ToggleOutputPin(GPIO_RegDef_t *pGPIOx, uint8_t PinNumber);

// IRQ configuration and ISR Handling

void GPIO_IRQITConfig(uint8_t IRQNumber ,uint8_t EnorDi);
void GPIO_IRQPriorityConfig(uint8_t IRQNumber ,uint8_t IRQPriority);
void GPIO_IRQHandling(uint8_t PinNumber);

#endif /* STM32H753_GPIO_DRIVER_H_ */
